{
  "title": "KVD Studio",
  "email": "hello@kvd.studio",
  "home": {
    "photography": {
      "text": "As the former Executive Officer for Promotions and Documentation of UP Iris—a university-wide student organization—I received and conducted training in the art of storytelling through photography. Today, I continue to draw inspiration and learnings from established photographers, both foreign and local, in order to hone my own craft. I mainly focus on concert and portrait photography. However, I do like to be well-rounded, and I don't mind venturing into street, landscape, and product photography every once in a while.",
      "carousel": [
        "kdphotography/portfolio/static/portfolio/media-private/live/20200213_124.jpg",
        "kdphotography/portfolio/static/portfolio/media-private/live/20200213_120.jpg",
        "kdphotography/portfolio/static/portfolio/media-private/live/20200212_20.jpg",
        "kdphotography/portfolio/static/portfolio/media-private/live/20200212_54.jpg",
        "kdphotography/portfolio/static/portfolio/media-private/live/20200212_41.jpg",
        "kdphotography/portfolio/static/portfolio/media-private/live/20200212_16.jpg",
        "kdphotography/portfolio/static/portfolio/media-private/live/20200212_15.jpg"
      ]
    },
    "dev": {
      "text": "I am currently a full-time software engineer and a Google Cloud Certified Professional Cloud Architect. Python and TypeScript are my primary development languages, and my go-to stack is Django + React.js (although this website is written in Astro + Svelte). Some of my work involves architecting and developing cloud solutions, web applications, data pipelines, APIs, command-line interfaces, and chat bots, among others."
    },
    "vip": {
      "text": "For my undergraduate thesis, I joined the Instrumentation Physics Laboratory-Video & Image Processing subgroup. My research was initially on blood spatter analysis (BPA). Due to limited equipment, I was tasked to find a way to extract useful information from possibly incomplete measurements. This led me to the field of compressive sensing (CS), which became my main field of research. In this endeavor, I utilized various technologies such as established signal processing techniques, as well as more contemporary machine learning and artificial intelligence approaches."
    }
  },
  "about": {
    "photo": "kdphotography/portfolio/static/portfolio/media-private/about/bio",
    "text": "Hi, I'm Kenneth! I am currently a software engineer at Thinking Machines Data Science, and a Google Cloud Certified Professional Cloud Architect. I graduated with a degree in Applied Physics from the University of the Philippines Diliman. For my undergraduate thesis, I joined the Instrumentation Physics Laboratory with a research concentration on signal, video, and image processing. In my spare time, I like to dabble a bit in various fields like music composition & production, photography, artificial intelligence, and electronics, to name a few. I am also an alumni and former Executive Officer for Promotions and Documentation of UP Iris, a university-wide photography organization.\n\nFeel free to contact me for inquiries, collaborations, and other concerns!"
  }
}
